docs(lib-network-protocol): use mermaid diagram on sender readme.md
